; domain
(define (domain BLOCKS)
	(:requirements :strips :typing :equality)
	(:types block)
	(:constants )
	(:functions
		(total-cost )
	)
	(:predicates
		(split )
		(unsplit )
		(g0_done___ )
		(g1_done___ )
		(g2_done___ )
		(g0_achieved0 )
		(g1_achieved0 )
		(g2_achieved0 )
		(g0_achieved1 )
		(g1_achieved1 )
		(g2_achieved1 )
		(g0_achieved2 )
		(g1_achieved2 )
		(g2_achieved2 )
		(g0_on ?x1 - block ?x2 - block)
		(g1_on ?x1 - block ?x2 - block)
		(g2_on ?x1 - block ?x2 - block)
		(g0_ontable ?x1 - block)
		(g1_ontable ?x1 - block)
		(g2_ontable ?x1 - block)
		(g0_clear ?x1 - block)
		(g1_clear ?x1 - block)
		(g2_clear ?x1 - block)
		(g0_handempty )
		(g1_handempty )
		(g2_handempty )
		(g0_holding ?x1 - block)
		(g1_holding ?x1 - block)
		(g2_holding ?x1 - block)
		(g0_achieved0 )
		(g1_achieved0 )
		(g2_achieved0 )
		(g0_achieved1 )
		(g1_achieved1 )
		(g2_achieved1 )
		(g0_achieved2 )
		(g1_achieved2 )
		(g2_achieved2 )
	)
(:action do-split
	:parameters ()
	:precondition (and (unsplit ))
	:effect (and (not (unsplit )) (split ))
)
(:action mark-done-g0
	:parameters ()
	:precondition (and (split ) (g0_clear e) (g0_on e a) (g0_on a t) (g0_ontable t))
	:effect (and (g0_done___ ))
)
(:action mark-done-g1
	:parameters ()
	:precondition (and (split ) (g1_clear a) (g1_on a p) (g1_on p t) (g1_on t e) (g1_on e r) (g1_ontable r))
	:effect (and (g1_done___ ))
)
(:action mark-done-g2
	:parameters ()
	:precondition (and (split ) (g2_clear t) (g2_on t e) (g2_on e a) (g2_on a r) (g2_ontable r))
	:effect (and (g2_done___ ))
)
(:action gGLOBAL_pick-up
	:parameters (?x1 - block)
	:precondition (and (unsplit ) (g0_clear ?x1) (g1_clear ?x1) (g2_clear ?x1) (g0_ontable ?x1) (g1_ontable ?x1) (g2_ontable ?x1) (g0_handempty ) (g1_handempty ) (g2_handempty ))
	:effect (and (not (g0_achieved0 )) (not (g1_achieved0 )) (not (g2_achieved0 )) (not (g0_achieved1 )) (not (g1_achieved1 )) (not (g2_achieved1 )) (not (g0_achieved2 )) (not (g1_achieved2 )) (not (g2_achieved2 )) (not (g0_ontable ?x1)) (not (g1_ontable ?x1)) (not (g2_ontable ?x1)) (not (g0_clear ?x1)) (not (g1_clear ?x1)) (not (g2_clear ?x1)) (not (g0_handempty )) (not (g1_handempty )) (not (g2_handempty )) (g0_holding ?x1) (g1_holding ?x1) (g2_holding ?x1) (increase (total-cost ) 1))
)
(:action g0_pick-up
	:parameters (?x1 - block)
	:precondition (and (g0_clear ?x1) (g0_ontable ?x1) (g0_handempty ) (split ))
	:effect (and (not (g0_achieved0 )) (not (g0_achieved1 )) (not (g0_achieved2 )) (not (g0_ontable ?x1)) (not (g0_clear ?x1)) (not (g0_handempty )) (g0_holding ?x1) (increase (total-cost ) 139956.0))
)
(:action g1_pick-up
	:parameters (?x1 - block)
	:precondition (and (g1_clear ?x1) (g1_ontable ?x1) (g1_handempty ) (split ) (g0_done___ ))
	:effect (and (not (g1_achieved0 )) (not (g1_achieved1 )) (not (g1_achieved2 )) (not (g1_ontable ?x1)) (not (g1_clear ?x1)) (not (g1_handempty )) (g1_holding ?x1) (increase (total-cost ) 23166.0))
)
(:action g2_pick-up
	:parameters (?x1 - block)
	:precondition (and (g2_clear ?x1) (g2_ontable ?x1) (g2_handempty ) (split ) (g1_done___ ))
	:effect (and (not (g2_achieved0 )) (not (g2_achieved1 )) (not (g2_achieved2 )) (not (g2_ontable ?x1)) (not (g2_clear ?x1)) (not (g2_handempty )) (g2_holding ?x1) (increase (total-cost ) 27954.0))
)
(:action gGLOBAL_put-down
	:parameters (?x1 - block)
	:precondition (and (unsplit ) (g0_holding ?x1) (g1_holding ?x1) (g2_holding ?x1))
	:effect (and (not (g0_achieved0 )) (not (g1_achieved0 )) (not (g2_achieved0 )) (not (g0_achieved1 )) (not (g1_achieved1 )) (not (g2_achieved1 )) (not (g0_achieved2 )) (not (g1_achieved2 )) (not (g2_achieved2 )) (not (g0_holding ?x1)) (not (g1_holding ?x1)) (not (g2_holding ?x1)) (g0_clear ?x1) (g1_clear ?x1) (g2_clear ?x1) (g0_handempty ) (g1_handempty ) (g2_handempty ) (g0_ontable ?x1) (g1_ontable ?x1) (g2_ontable ?x1) (increase (total-cost ) 1))
)
(:action g0_put-down
	:parameters (?x1 - block)
	:precondition (and (g0_holding ?x1) (split ))
	:effect (and (not (g0_achieved0 )) (not (g0_achieved1 )) (not (g0_achieved2 )) (not (g0_holding ?x1)) (g0_clear ?x1) (g0_handempty ) (g0_ontable ?x1) (increase (total-cost ) 139956.0))
)
(:action g1_put-down
	:parameters (?x1 - block)
	:precondition (and (g1_holding ?x1) (split ) (g0_done___ ))
	:effect (and (not (g1_achieved0 )) (not (g1_achieved1 )) (not (g1_achieved2 )) (not (g1_holding ?x1)) (g1_clear ?x1) (g1_handempty ) (g1_ontable ?x1) (increase (total-cost ) 23166.0))
)
(:action g2_put-down
	:parameters (?x1 - block)
	:precondition (and (g2_holding ?x1) (split ) (g1_done___ ))
	:effect (and (not (g2_achieved0 )) (not (g2_achieved1 )) (not (g2_achieved2 )) (not (g2_holding ?x1)) (g2_clear ?x1) (g2_handempty ) (g2_ontable ?x1) (increase (total-cost ) 27954.0))
)
(:action gGLOBAL_stack
	:parameters (?x1 - block ?x2 - block)
	:precondition (and (unsplit ) (g0_holding ?x1) (g1_holding ?x1) (g2_holding ?x1) (g0_clear ?x2) (g1_clear ?x2) (g2_clear ?x2))
	:effect (and (not (g0_achieved0 )) (not (g1_achieved0 )) (not (g2_achieved0 )) (not (g0_achieved1 )) (not (g1_achieved1 )) (not (g2_achieved1 )) (not (g0_achieved2 )) (not (g1_achieved2 )) (not (g2_achieved2 )) (not (g0_holding ?x1)) (not (g1_holding ?x1)) (not (g2_holding ?x1)) (not (g0_clear ?x2)) (not (g1_clear ?x2)) (not (g2_clear ?x2)) (g0_clear ?x1) (g1_clear ?x1) (g2_clear ?x1) (g0_handempty ) (g1_handempty ) (g2_handempty ) (g0_on ?x1 ?x2) (g1_on ?x1 ?x2) (g2_on ?x1 ?x2) (increase (total-cost ) 1))
)
(:action g0_stack
	:parameters (?x1 - block ?x2 - block)
	:precondition (and (g0_holding ?x1) (g0_clear ?x2) (split ))
	:effect (and (not (g0_achieved0 )) (not (g0_achieved1 )) (not (g0_achieved2 )) (not (g0_holding ?x1)) (not (g0_clear ?x2)) (g0_clear ?x1) (g0_handempty ) (g0_on ?x1 ?x2) (increase (total-cost ) 139956.0))
)
(:action g1_stack
	:parameters (?x1 - block ?x2 - block)
	:precondition (and (g1_holding ?x1) (g1_clear ?x2) (split ) (g0_done___ ))
	:effect (and (not (g1_achieved0 )) (not (g1_achieved1 )) (not (g1_achieved2 )) (not (g1_holding ?x1)) (not (g1_clear ?x2)) (g1_clear ?x1) (g1_handempty ) (g1_on ?x1 ?x2) (increase (total-cost ) 23166.0))
)
(:action g2_stack
	:parameters (?x1 - block ?x2 - block)
	:precondition (and (g2_holding ?x1) (g2_clear ?x2) (split ) (g1_done___ ))
	:effect (and (not (g2_achieved0 )) (not (g2_achieved1 )) (not (g2_achieved2 )) (not (g2_holding ?x1)) (not (g2_clear ?x2)) (g2_clear ?x1) (g2_handempty ) (g2_on ?x1 ?x2) (increase (total-cost ) 27954.0))
)
(:action gGLOBAL_unstack
	:parameters (?x1 - block ?x2 - block)
	:precondition (and (unsplit ) (g0_on ?x1 ?x2) (g1_on ?x1 ?x2) (g2_on ?x1 ?x2) (g0_clear ?x1) (g1_clear ?x1) (g2_clear ?x1) (g0_handempty ) (g1_handempty ) (g2_handempty ))
	:effect (and (not (g0_achieved0 )) (not (g1_achieved0 )) (not (g2_achieved0 )) (not (g0_achieved1 )) (not (g1_achieved1 )) (not (g2_achieved1 )) (not (g0_achieved2 )) (not (g1_achieved2 )) (not (g2_achieved2 )) (g0_holding ?x1) (g1_holding ?x1) (g2_holding ?x1) (g0_clear ?x2) (g1_clear ?x2) (g2_clear ?x2) (not (g0_clear ?x1)) (not (g1_clear ?x1)) (not (g2_clear ?x1)) (not (g0_handempty )) (not (g1_handempty )) (not (g2_handempty )) (not (g0_on ?x1 ?x2)) (not (g1_on ?x1 ?x2)) (not (g2_on ?x1 ?x2)) (increase (total-cost ) 1))
)
(:action g0_unstack
	:parameters (?x1 - block ?x2 - block)
	:precondition (and (g0_on ?x1 ?x2) (g0_clear ?x1) (g0_handempty ) (split ))
	:effect (and (not (g0_achieved0 )) (not (g0_achieved1 )) (not (g0_achieved2 )) (g0_holding ?x1) (g0_clear ?x2) (not (g0_clear ?x1)) (not (g0_handempty )) (not (g0_on ?x1 ?x2)) (increase (total-cost ) 139956.0))
)
(:action g1_unstack
	:parameters (?x1 - block ?x2 - block)
	:precondition (and (g1_on ?x1 ?x2) (g1_clear ?x1) (g1_handempty ) (split ) (g0_done___ ))
	:effect (and (not (g1_achieved0 )) (not (g1_achieved1 )) (not (g1_achieved2 )) (g1_holding ?x1) (g1_clear ?x2) (not (g1_clear ?x1)) (not (g1_handempty )) (not (g1_on ?x1 ?x2)) (increase (total-cost ) 23166.0))
)
(:action g2_unstack
	:parameters (?x1 - block ?x2 - block)
	:precondition (and (g2_on ?x1 ?x2) (g2_clear ?x1) (g2_handempty ) (split ) (g1_done___ ))
	:effect (and (not (g2_achieved0 )) (not (g2_achieved1 )) (not (g2_achieved2 )) (g2_holding ?x1) (g2_clear ?x2) (not (g2_clear ?x1)) (not (g2_handempty )) (not (g2_on ?x1 ?x2)) (increase (total-cost ) 27954.0))
)
)

; problem
(define (problem p1)
	(:domain blocks)
	(:objects p - block a - block t - block e - block r - block)
	(:init 
		(unsplit )
		(g0_HANDEMPTY )
		(g1_HANDEMPTY )
		(g2_HANDEMPTY )
		(g0_ONTABLE r)
		(g1_ONTABLE r)
		(g2_ONTABLE r)
		(g0_CLEAR t)
		(g1_CLEAR t)
		(g2_CLEAR t)
		(g0_ON t r)
		(g1_ON t r)
		(g2_ON t r)
		(g0_ONTABLE p)
		(g1_ONTABLE p)
		(g2_ONTABLE p)
		(g0_CLEAR e)
		(g1_CLEAR e)
		(g2_CLEAR e)
		(g0_ON a p)
		(g1_ON a p)
		(g2_ON a p)
		(g0_ON e a)
		(g1_ON e a)
		(g2_ON e a)
		(= (total-cost ) 0.0)
	)
	(:goal (and (g0_clear e) (g0_on e a) (g0_on a t) (g0_ontable t) (g1_clear a) (g1_on a p) (g1_on p t) (g1_on t e) (g1_on e r) (g1_ontable r) (g2_clear t) (g2_on t e) (g2_on e a) (g2_on a r) (g2_ontable r)))
	(:metric minimize (total-cost ))
)

; plan
1. (gglobal_unstack t r)
   deleted: (g0_clear t) (g1_clear t) (g2_clear t) (g0_handempty) (g1_handempty) (g2_handempty) (g0_on t r) (g1_on t r) (g2_on t r)
   added: (g0_holding t) (g1_holding t) (g2_holding t) (g0_clear r) (g1_clear r) (g2_clear r)
   goals met: 6 of 15
2. (gglobal_put-down t)
   deleted: (g0_holding t) (g1_holding t) (g2_holding t)
   added: (g0_clear t) (g1_clear t) (g2_clear t) (g0_handempty) (g1_handempty) (g2_handempty) (g0_ontable t) (g1_ontable t) (g2_ontable t)
   goals met: 8 of 15
3. (gglobal_unstack e a)
   deleted: (g0_clear e) (g1_clear e) (g2_clear e) (g0_handempty) (g1_handempty) (g2_handempty) (g0_on e a) (g1_on e a) (g2_on e a)
   added: (g0_holding e) (g1_holding e) (g2_holding e) (g0_clear a) (g1_clear a) (g2_clear a)
   goals met: 6 of 15
4. (gglobal_stack e r)
   deleted: (g0_holding e) (g1_holding e) (g2_holding e) (g0_clear r) (g1_clear r) (g2_clear r)
   added: (g0_clear e) (g1_clear e) (g2_clear e) (g0_handempty) (g1_handempty) (g2_handempty) (g0_on e r) (g1_on e r) (g2_on e r)
   goals met: 8 of 15
5. (gglobal_unstack a p)
   deleted: (g0_clear a) (g1_clear a) (g2_clear a) (g0_handempty) (g1_handempty) (g2_handempty) (g0_on a p) (g1_on a p) (g2_on a p)
   added: (g0_holding a) (g1_holding a) (g2_holding a) (g0_clear p) (g1_clear p) (g2_clear p)
   goals met: 6 of 15
6. (gglobal_stack a t)
   deleted: (g0_holding a) (g1_holding a) (g2_holding a) (g0_clear t) (g1_clear t) (g2_clear t)
   added: (g0_clear a) (g1_clear a) (g2_clear a) (g0_handempty) (g1_handempty) (g2_handempty) (g0_on a t) (g1_on a t) (g2_on a t)
   goals met: 7 of 15
7. (gglobal_unstack e r)
   deleted: (g0_clear e) (g1_clear e) (g2_clear e) (g0_handempty) (g1_handempty) (g2_handempty) (g0_on e r) (g1_on e r) (g2_on e r)
   added: (g0_holding e) (g1_holding e) (g2_holding e) (g0_clear r) (g1_clear r) (g2_clear r)
   goals met: 5 of 15
8. (gglobal_stack e a)
   deleted: (g0_holding e) (g1_holding e) (g2_holding e) (g0_clear a) (g1_clear a) (g2_clear a)
   added: (g0_clear e) (g1_clear e) (g2_clear e) (g0_handempty) (g1_handempty) (g2_handempty) (g0_on e a) (g1_on e a) (g2_on e a)
   goals met: 7 of 15
9. (do-split)
   deleted: (unsplit)
   added: (split)
   goals met: 7 of 15
10. (mark-done-g0)
   added: (g0_done___)
   goals met: 7 of 15
11. (g1_unstack e a)
   deleted: (g1_clear e) (g1_handempty) (g1_on e a)
   added: (g1_holding e) (g1_clear a)
   goals met: 8 of 15
12. (g1_stack e r)
   deleted: (g1_holding e) (g1_clear r)
   added: (g1_clear e) (g1_handempty) (g1_on e r)
   goals met: 9 of 15
13. (g1_unstack a t)
   deleted: (g1_clear a) (g1_handempty) (g1_on a t)
   added: (g1_holding a) (g1_clear t)
   goals met: 8 of 15
14. (g1_put-down a)
   deleted: (g1_holding a)
   added: (g1_clear a) (g1_handempty) (g1_ontable a)
   goals met: 9 of 15
15. (g1_pick-up t)
   deleted: (g1_ontable t) (g1_clear t) (g1_handempty)
   added: (g1_holding t)
   goals met: 9 of 15
16. (g1_stack t e)
   deleted: (g1_holding t) (g1_clear e)
   added: (g1_clear t) (g1_handempty) (g1_on t e)
   goals met: 10 of 15
17. (g1_pick-up p)
   deleted: (g1_ontable p) (g1_clear p) (g1_handempty)
   added: (g1_holding p)
   goals met: 10 of 15
18. (g1_stack p t)
   deleted: (g1_holding p) (g1_clear t)
   added: (g1_clear p) (g1_handempty) (g1_on p t)
   goals met: 11 of 15
19. (g1_pick-up a)
   deleted: (g1_ontable a) (g1_clear a) (g1_handempty)
   added: (g1_holding a)
   goals met: 10 of 15
20. (g1_stack a p)
   deleted: (g1_holding a) (g1_clear p)
   added: (g1_clear a) (g1_handempty) (g1_on a p)
   goals met: 12 of 15
21. (mark-done-g1)
   added: (g1_done___)
   goals met: 12 of 15
22. (g2_unstack e a)
   deleted: (g2_clear e) (g2_handempty) (g2_on e a)
   added: (g2_holding e) (g2_clear a)
   goals met: 11 of 15
23. (g2_stack e p)
   deleted: (g2_holding e) (g2_clear p)
   added: (g2_clear e) (g2_handempty) (g2_on e p)
   goals met: 11 of 15
24. (g2_unstack a t)
   deleted: (g2_clear a) (g2_handempty) (g2_on a t)
   added: (g2_holding a) (g2_clear t)
   goals met: 12 of 15
25. (g2_stack a r)
   deleted: (g2_holding a) (g2_clear r)
   added: (g2_clear a) (g2_handempty) (g2_on a r)
   goals met: 13 of 15
26. (g2_unstack e p)
   deleted: (g2_clear e) (g2_handempty) (g2_on e p)
   added: (g2_holding e) (g2_clear p)
   goals met: 13 of 15
27. (g2_stack e a)
   deleted: (g2_holding e) (g2_clear a)
   added: (g2_clear e) (g2_handempty) (g2_on e a)
   goals met: 14 of 15
28. (g2_pick-up t)
   deleted: (g2_ontable t) (g2_clear t) (g2_handempty)
   added: (g2_holding t)
   goals met: 13 of 15
29. (g2_stack t e)
   deleted: (g2_holding t) (g2_clear e)
   added: (g2_clear t) (g2_handempty) (g2_on t e)
   goals met: 15 of 15
